<?php

return [
    'throttle' => 'درخواست های بیش از اندازه',
    'not-found' => 'یافت نشد',
    'validation' => 'اطلاعات وارد شده معتبر نمی باشد',
    'authentication' => 'Unauthenticated!',
    'not_found' => 'اطلاعاتی درخواستی یافت نشد',
    'not_found_r' => 'خطایی بوجود آمده است اطلاعاتی درخواستی شما یافت نشد',
    'model_not_found' => ':model درخواستی یافت نشد.',
    'not_access' => 'شما دسترسی کافی ندارید',
    'not_auth' => 'شما وارد سیستم نشده اید',
    'method_not_allow' => 'متد معتبر نمی باشد',
    'access_deny' => 'شما دسترسی ندارید',
    'too_many_request' => 'درخواست بیش از اندازه! بسه دیگه',
    'invalid_request' => 'درخواست نامعتبر است',
    'not_found_transaction' => 'تراکنش یافت نشد',
    'port_not_found' => 'درگاه یافت نشد',
    'pay_send_exception' => 'در حال حاضر درگاه پرداخت قطع می باشد به زودی مشکل برطرف خواهد شد',
    'action_exception' => 'در حال حاضر این امکان فعال نمی باشد',
    'invalid_data' => 'داده های ارسالی معتبر نمی باشد',
    'invalid_hash_pay' => 'تراکنش یافت نشد',

    'user' => [
        'not_found' => 'اطلاعات ورودی نادرست است',
        'status' => 'شخص شما در سیستم غیرفعال می باشید لطفا با پشتیبانی تماس بگیرید',
        'invalid_pass' => 'اطلاعات ورودی نادرست است',
    ],

    'account' => [
        'not_found' => 'اکانت یافت نشد'
    ],

    'user_status' => [
        'in_use' => 'یک وضعیت در حال استفاده می بایست موجود باشد'
    ],

    'advertising' => [
        'send_notification' => 'برای ارسال نوتیفیکیشن, گزینه ی قابل نمایش بودن پس از ثبت را انتخاب کنید'
    ],

    'support' => [
        'is_blocked' => 'شما به دلیل نقض قوانین سیستم, توانایی ارسال تیکت را ندارید',
        'is_closed' => 'تیکت بسته شده است و قابل تغییر نیست'
    ]
];
