<?php

/**
 * @var array
 */
$panel_permissions = [

    [
        'module' => 'admins',
        'perms' => [
            'admin_list',
            'admin_show',
            'admin_store',
            'admin_update',
            'admin_destroy',
        ],
    ],

    [
        'module' => 'roles',
        'perms' => [
            'role_list',
            'role_show',
            'role_store',
            'role_show_permissions',
            'role_update_permissions',
            'role_update',
            'role_destroy',
            'permission_list',
        ],
    ],

];

$mobile_permissions = [
    //
];

return [

    'panel_permissions' => $panel_permissions,

    'mobile_permissions' => $mobile_permissions,

    'roles' => [
        'super_admin' => [
            'label' => 'ادمین کل',
            'description' => 'تمامی مجوز های سمت پنل مدیریت سیستم را داراست.',
            'delete_able' => false,
            'permissions' => $panel_permissions,
        ],

        'operator' => [
            'label' => 'اپراتور',
            'description' => 'بخشی از مجوز های سمت پنل مدیریت سیستم را داراست.',
            'delete_able' => false,
            'permissions' => [
                //
            ],
        ],

    ],

    /*
    |--------------------------------------------------------------------------
    | Role Model
    |--------------------------------------------------------------------------
    */
    'role' => 'App\Domain\Users\Models\Role',

    /*
    |--------------------------------------------------------------------------
    | Roles Table
    |--------------------------------------------------------------------------
    */
    'roles_table' => 'roles',

    /*
    |--------------------------------------------------------------------------
    | role foreign key
    |--------------------------------------------------------------------------
    */
    'role_foreign_key' => 'role_id',

    /*
    |--------------------------------------------------------------------------
    | Application Admin Model
    |--------------------------------------------------------------------------
    */
    'admin' => 'App\Domain\Users\Models\Admin',

    /*
    |--------------------------------------------------------------------------
    | Application Admins Table
    |--------------------------------------------------------------------------
    */
    'admins_table' => 'admins',

    /*
    |--------------------------------------------------------------------------
    | role_admin Table
    |--------------------------------------------------------------------------
    */
    'role_admin_table' => 'role_admin',

    /*
    |--------------------------------------------------------------------------
    | permission_admin Table
    |--------------------------------------------------------------------------
    */
    'permission_admin_table' => 'permission_admin',

    /*
    |--------------------------------------------------------------------------
    | admin foreign key
    |--------------------------------------------------------------------------
    */
    'admin_foreign_key' => 'admin_id',

    /*
    |--------------------------------------------------------------------------
    | Permission Model
    |--------------------------------------------------------------------------
    */
    'permission' => 'App\Domain\Users\Models\Permission',

    /*
    |--------------------------------------------------------------------------
    | Permissions Table
    |--------------------------------------------------------------------------
    */
    'permissions_table' => 'permissions',

    /*
    |--------------------------------------------------------------------------
    | permission_role Table
    |--------------------------------------------------------------------------
    */
    'permission_role_table' => 'permission_role',

    /*
    |--------------------------------------------------------------------------
    | permission foreign key
    |--------------------------------------------------------------------------
    */
    'permission_foreign_key' => 'permission_id',

];
